In [1]:
import duckdb

In [2]:
con=duckdb.connect(database='dados_duckdb.bd', read_only=False)

In [3]:
df=con.execute("""
            SELECT * FROM produtos
            """).fetchdf()

In [4]:
df.head(100)

      id nm_produto id_categoria  id_fornecedor  vl_preco
0  10002    MARTELO         BT50            100    1500.0
1  10001   PARAFUSO         BT10            100     100.0
2  10004      SERRA         BT50            100     200.0
3  10005    MACHADO         BT50            100     100.0
4  10003      PREGO         BT10            100      50.0

In [5]:
df2=df.drop(columns=['id_categoria','id_fornecedor'])
df2.head(100)

      id nm_produto  vl_preco
0  10002    MARTELO    1500.0
1  10001   PARAFUSO     100.0
2  10004      SERRA     200.0
3  10005    MACHADO     100.0
4  10003      PREGO      50.0

In [6]:
con.execute("""
            CREATE TABLE IF NOT EXISTS dim_produtos(
            id_produto BIGINT,
            nm_produto TEXT,
            vl_produto FLOAT
            )
""" )

In [7]:
df_dim=con.execute(" SELECT * FROM DIM_PRODUTOS").fetchdf()
df_dim.head(100)

Empty DataFrame
Columns: [id_produto, nm_produto, vl_produto]
Index: []

In [8]:
con.execute("insert into dim_produtos select * from df2")

In [9]:
df_dim=con.execute(" SELECT * FROM DIM_PRODUTOS").fetchdf()
df_dim.head(100)

   id_produto nm_produto  vl_produto
0       10002    MARTELO      1500.0
1       10001   PARAFUSO       100.0
2       10004      SERRA       200.0
3       10005    MACHADO       100.0
4       10003      PREGO        50.0

In [10]:
con.close()